posts/Spacemacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Spacemacs</title>
<!-- 2015-05-14 Thu 11:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Boris Buliga &lt;d12frosted@icloud.com&gt;" />
<link rel='stylesheet' type='text/css' href='/css/default.css' />
<link rel='stylesheet' href='/font-awesome/css/font-awesome.min.css'>
</head>
<body>
<div id="content">
<h1 class="title">Spacemacs</h1>
<header>
  <hr>
  <ul class="nav-list">
    <li class="nav-elem nav-left nav-head">
      <a href="/"><i class="fa fa-home"></i> d12frosted</a>
    </li>
    <li class="nav-elem nav-right">
      <a href="http://stackoverflow.com/users/3086454/d12frosted"><i class="fa fa-stack-overflow"></i> StackOverflow</a>
    </li>
    <li class="nav-elem nav-right">
      <a href="https://github.com/d12frosted"><i class="fa fa-github"></i> GitHub</a>
    </li>
  </ul>
  <hr>
</header>

<p>
Actually I wanted to write about mu4e and some other tools that are required in order to read email right in your emacs, but turned out that this subject is a bit hard to write about, so while the work on that tutorial / post is in progress, I decided to write few words about Spacemacs - a great starter kit for Emacs that I was using for the last two weeks. But to be fair - I am not using it anymore. Why - read further!
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Intro</a></li>
<li><a href="#sec-2">First impression</a></li>
<li><a href="#sec-3">So why abandon it?</a></li>
<li><a href="#sec-4">And what about the Evil part?</a></li>
<li><a href="#sec-5">And the link</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
Time to time I am looking for something new to try in Emacs. Actually, almost always I find something really exciting. Something I want to give a try as soon as possible. So when I found someone mentioning Spacemacs on the internet I followed the link to Spacemacs repository on github. I checked it's description and thought that this is the thing I should install and use. And so I did.
</p>

<p>
Spacemacs is trying to bring best from emacs and vim to one editor – emacs. That's great, but honestly, I never liked vim (probably because I never truly used it). But the authors of this project assured me that it's OK if I never will use the 'vim' part. So basically from my point of view, spacemacs is a beefed version of emacs. I remember trying <code>Prelude</code> project just to see a big and complicated starter pack. I don't have anything against <code>Prelude</code> but for me it was too hard and too restrictive. Plus a bit slow. So when I saw Spacemacs I thought that I should try it, but I did it without any big expectations.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">First impression</h2>
<div class="outline-text-2" id="text-2">
<p>
My first impression after I installed it (without any problems, I must admit) was just 'WOW!'. Things that I found incredibly great about Spacemacs are:
</p>

<ul class="org-ul">
<li>fast startup
</li>
<li>lazy loading of heavy packages
</li>
<li>just a lot of things that work as a clock together because of good configurations
</li>
<li>and again - great configurations
</li>
<li>great idea of layers
</li>
<li>it's very easy to extend configurations or even dramatically change them
</li>
<li>great community
</li>
</ul>

<p>
I never tried a lot if things before I used Spacemacs. For example, I was amazed on how fast the startup time is. Then I found that it's because of <code>use-package</code> macro (big thanks to author). Also I never tried <code>helm</code>. Still can't say that I really like it, but it was a great experience to see it greatly configured and use it for a bit. Also I found so much cool configurations and key bindings that I was really shocked and ashamed that I never had such configurations and consistent key bindings. I've found some new things about org mode (indentation mode, fancy bullets and some other modes). Also I found some great configurations for emacs-lisp mode, company-mode, csharp/omnisharp. I tried some great configurations for editing xml files, python sources. I found myself switching files and projects very fast because of recentf, projectile and sometimes of some ag magic. So I need to say that I learned very much new things about Emacs from Spacemacs. It was a good boost for me.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">So why abandon it?</h2>
<div class="outline-text-2" id="text-3">
<p>
It's the same as with <code>oh-my-zsh</code>. It might be very cool. But firstly, it's not you who makes decisions and changes. And secondly, it has so much stuff you never need. I find it much more pleasant to improve my own configurations. It gives me much more space for experimenting.
</p>

<p>
But I found a lot of great things in sources of Spacemacs. So now I am just improving my own configurations by stealing from Spacemacs some good ideas and lines of code (sorry).
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">And what about the Evil part?</h2>
<div class="outline-text-2" id="text-4">
<p>
Sorry, but I haven't used it very much. As I said, I am not the 'vim' guy. It just doesn't work for me (at least now). But I keep hearing from vi users that they like Spacemacs very much. So if you are a vi or evil user - you should try it as well.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">And the link</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://github.com/syl20bnr/spacemacs">Spacemacs</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-05-04&gt;</span></span></p>
<p class="author">Author: Boris Buliga &lt;d12frosted@icloud.com&gt;</p>
<p class="email">Email: <a href="mailto:d12frosted@icloud.com">d12frosted@icloud.com</a></p>
<p class="date">Created: 2015-05-14 Thu 11:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
